<h1 style="
  font-family: Georgia, serif;
  font-size: 44px;
  text-align: center;
  color: #ef12d2;
  margin: 30px 0 10px 0;
">
Pandas Introduction
</h1>

<p style="
  text-align:center;
  font-size:16px;
  color:#6b7280;
">
Pandas is an open-source Python library used for data manipulation, analysis and cleaning. It provides fast and flexible tools to work with tabular data, similar to spreadsheets or SQL tables.
</p>

<div style="
  background: #f9fafb;
  border-radius: 12px;
  padding: 18px;
  box-shadow: 0 4px 10px rgba(0,0,0,0.08);
  margin: 20px 0;
">
  <h4 style="margin-top:0; color:#111827;">Pandas is used in data Science,ML,Finance</h4>
  <p style="margin-bottom:0; color:black">
    NumPy: numerical operations
    Matplotlib and Seaborn: data visualization
    SciPy: statistical analysis
    Scikit-learn: machine learning workflows
  </p>
</div>

Data Structures 
1.panda Series

2.Panda DataFrame

3.operations-Loading data,viewing and exploring data,
handling missing data,selecting and filtering data,adding and removing columns,grouping data

In [2]:
import pandas as pd
df=pd.DataFrame()
print(df)
lst=['Harshith','vinesh','rao','saritha','rani']
df=pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
          0
0  Harshith
1    vinesh
2       rao
3   saritha
4      rani

In [3]:
import numpy as np
data=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(data,columns=['A','B','C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
#json resonses often contain lists of dictionaries
dict={'name':['Harshith','vinesh','rao','saritha','rani'],
        'degree':['btech','cse','2nd Year','Law','PG'],
        'score':[89,98,67,99,99]}
df=pd.DataFrame(dict)
print(df)

       name    degree  score
0  Harshith     btech     89
1    vinesh       cse     98
2       rao  2nd Year     67
3   saritha       Law     99
4      rani        PG     99

pandas.DataFrame(data, index, columns) 

Parameters: 

 data: It is a dataset from which a DataFrame is to be created. It can be a list, dictionary, scalar value, series, and arrays, etc. 

 index: It is optional, by default the index of the DataFrame starts from 0 and ends at the last data value(n-1). It defines the row label explicitly.
  
 columns: This parameter is used to provide column names in the DataFrame. If the column name is not defined by default, it will take a value from 0 to n-1. 
Returns:

DataFrame object

In [2]:
import pandas as pd
df=pd.read_csv("people_data.csv")
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

<p style="font-family:Fantasy">
<code>read_csv()</code> function in pandas is used to read data from CSV files into a pandas Dataframe
</p>
<code>pd.read_csv(filepath_or_buffer, sep=' ,' , header='infer',  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None)</code>
<p>filepath_or_buffer: Location of the csv file. It accepts any string path or URL of the file.
sep: It stands for separator, default is ', '.
header: It accepts int, a list of int, row numbers to use as the column names, and the start of the data. If no names are passed, i.e., header=None, then, it will display the first column as 0, the second as 1, and so on.
usecols: Retrieves only selected columns from the CSV file.
nrows: Number of rows to be displayed from the dataset.
index_col: If None, there are no index numbers displayed along with records.  
skiprows: Skips passed rows in the new data frame.</p>

<h2 style="font-family:Cursive">Features</h2>

In [3]:
#read specific columns using read_csv
df=pd.read_csv("people_data.csv",usecols=["First Name","Email"])
print(df)

  First Name                       Email
0     Shelby        elijah57@example.net
1    Phillip       bethany14@example.com
2   Kristine       bthompson@example.com
3    Yesenia   kaitlinkaiser@example.com
4       Lori  buchananmanuel@example.net

In [4]:
#setting an index column
df=pd.read_csv("people_data.csv",index_col="First Name")
print(df)

           Last Name     Sex                       Email Date of birth  \
First Name
Shelby       Terrell    Male        elijah57@example.net    1945-10-26
Phillip      Summers  Female       bethany14@example.com    1910-03-24
Kristine      Travis    Male       bthompson@example.com    1992-07-02
Yesenia     Martinez    Male   kaitlinkaiser@example.com    2017-08-03
Lori            Todd    Male  buchananmanuel@example.net    1938-12-01

                     Job Title
First Name
Shelby         Games developer
Phillip         Phytotherapist
Kristine             Homeopath
Yesenia      Market researcher
Lori        Veterinary surgeon

In [6]:
# handling missing values 
df = pd.read_csv("people_data.csv", na_values=["N/A", "Unknown"])
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [7]:
# reading csv files with different delimiters
data="""totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4"""
with open("people_data.csv","w") as file:
    file.write(data)
print(data)

totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4

In [8]:
df=pd.read_csv('people_data.csv',sep='[:,|_]',#define the delimiters
               engine='python')
df

   totalbill   tip      sex smoker   day     time   size
0      16.99  1.01   Female     No   Sun   Dinner      2
1      10.34  1.66     Male     No   Sun   Dinner      3
2      21.01  3.50     Male     No   Sun   Dinner      3
3      23.68  3.31     Male     No   Sun   Dinner      2
4      24.59  3.61   Female     No   Sun   Dinner      4
5      25.29  4.71     Male     No   Sun   Dinner      4

In [10]:
df = pd.read_csv('people_data.csv', nrows=3)
df

                  totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN

In [11]:
df=pd.read_csv("people_data.csv")
print("Previous data:\n",df)
df=pd.read_csv("people_data.csv",skiprows=[4,5])
print("after:\n",df)

Previous data:
                   totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN
23.68                      3.31     Male|No      Sun_Dinner    2.0
24.59:3.61            Female_No         Sun          Dinner    4.0
25.29                 4.71|Male      No:Sun          Dinner    4.0
after:
                   totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN
25.29                 4.71|Male      No:Sun          Dinner    4.0

In [12]:
url = "https://media.geeksforgeeks.org/wp-content/uploads/20241121154629307916/people_data.csv"
df = pd.read_csv(url)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

<h2 style="font-family:Cursive">Python Pandas series</h2>
<p style="font-family:Cursive">A Pandas Series can be created from different data structures such as lists, NumPy arrays, dictionaries or scalar value.</p>
<header style="font-family:Cursive">
<h3>Accessing elements of Series</h3>
<li>Position-based Indexing</li>
<li>Label-based Indexing</li>
</header>
<header style="font-family:Cursive">
<h3>Indexing and Selecting Data </h3>
<li>Indexing a Series using .loc[]</li>
<li>Indexing a Series using .iloc[]</li>
</header>
<header style="font-family:Cursive">
<h3>Binary Operations on Pandas Series</h3>
</header>
<style>
.cursive-table {
    font-family: "Comic Sans MS", "Brush Script MT", cursive;
    font-size: 16px;
    border-collapse: collapse;
    width: 100%;
}

.cursive-table th, .cursive-table td {
    border: 1px solid #ccc;
    padding: 10px;
    text-align: left;
}

.cursive-table th {
    background-color: #f4f4f4;
}
</style>

<table class="cursive-table">
    <tr>
        <th>Method</th>
        <th>Description</th>
    </tr>
    <tr>
        <td><b>sub()</b></td>
        <td>Method is used to subtract series or list-like objects with same length from the caller series</td>
    </tr>
    <tr>
        <td><b>mul()</b></td>
        <td>Method is used to multiply series or list-like objects with same length with the caller series</td>
    </tr>
    <tr>
        <td><b>div()</b></td>
        <td>Method is used to divide series or list-like objects with same length by the caller series</td>
    </tr>
    <tr>
        <td><b>sum()</b></td>
        <td>Returns the sum of the values for the requested axis</td>
    </tr>
    <tr>
        <td><b>prod()</b></td>
        <td>Returns the product of the values for the requested axis</td>
    </tr>
    <tr>
        <td><b>mean()</b></td>
        <td>Returns the mean of the values for the requested axis</td>
    </tr>
    <tr>
        <td><b>pow()</b></td>
        <td>Method is used to put each element of passed series as exponential power of caller series and return the results</td>
    </tr>
    <tr>
        <td><b>abs()</b></td>
        <td>Method is used to get the absolute numeric value of each element in Series/DataFrame</td>
    </tr>
    <tr>
        <td><b>cov()</b></td>
        <td>Method is used to find covariance of two series</td>
    </tr>
</table>

In [1]:
import pandas as pd
data=[1,2,3,4]
ser=pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
import pandas as pd
import numpy as np

data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)

print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [3]:
import pandas as pd
import numpy as np

data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])

print(ser[16])

o

In [6]:
sd=pd.read_csv("nba.csv")
ser=pd.Series(sd['Name'])
data=ser.head(10)
print(data)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
9     Marcus Smart
Name: Name, dtype: object

In [7]:
data.loc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [8]:
#binary operations
ser1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
ser2 = pd.Series([4, 5, 6], index=['A', 'B', 'C'])

df_sum = ser1.add(ser2)
print(df_sum)

A    5
B    7
C    9
dtype: int64

<p style="font-family:Cursive">
A Pandas Series is like a single column of data in a spreadsheet. It is a one-dimensional array that can hold many types of data such as numbers, words or even other Python objects
</p>

In [9]:
ser=pd.Series()
ser

Series([], dtype: object)

In [10]:
data=np.array(['h','a','r','s','h','a'])
ser=pd.Series(data)
ser

0    h
1    a
2    r
3    s
4    h
5    a
dtype: object

In [11]:
import pandas as pd

data_list = ['g', 'e', 'e', 'k', 's']

ser = pd.Series(data_list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [12]:
data_dict={'Harsha':67,'saritha':99,'honey':67}
ser=pd.Series(data_dict)
ser

Harsha     67
saritha    99
honey      67
dtype: int64

In [13]:
sr=pd.Series(np.linspace(1,10,5))
sr

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [14]:
se=pd.Series(range(5,15))
se

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [15]:
s=pd.Series(range(1,20,3),index=[x for x in 'abcdefg'])
s

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

<code>DataFrame.head(n=5)
Series.head(n=5)</code>

In [3]:
import pandas as pd
data=pd.read_csv("nba.csv")
print("NBA Dataset (First 5 rows):\n",data.head())

NBA Dataset (First 5 rows):
             Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [4]:
series=data["Name"]
top=series.head(n=7)
print(top)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [5]:
import pandas as pd

data = pd.read_csv("nba.csv")

salary = data['Salary']

print("First 5 Salaries:")
print(salary.head())

First 5 Salaries:
0    7730337.0
1    6796117.0
2          NaN
3    1148640.0
4    5000000.0
Name: Salary, dtype: float64

In [6]:
salary_name=data[['Name','Salary']].head()
print(salary_name)

            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN
3    R.J. Hunter  1148640.0
4  Jonas Jerebko  5000000.0

In [7]:
sorted_data=data.sort_values(by='Age',ascending=True)
top_sorted=sorted_data.head()
print(top_sorted)

                   Name                    Team  Number Position   Age Height  \
226       Rashad Vaughn         Milwaukee Bucks    20.0       SG  19.0    6-6
122        Devin Booker            Phoenix Suns     1.0       SG  19.0    6-6
40   Kristaps Porzingis         New York Knicks     6.0       PF  20.0    7-3
401          Tyus Jones  Minnesota Timberwolves     1.0       PG  20.0    6-2
427     Cliff Alexander  Portland Trail Blazers    34.0       PF  20.0    6-8

     Weight   College     Salary
226   202.0      UNLV  1733040.0
122   206.0  Kentucky  2127840.0
40    240.0       NaN  4131720.0
401   195.0      Duke  1282080.0
427   240.0    Kansas   525093.0

<code>DataFrame.tail(n=5)
Series.tail(n=5)</code>

In [8]:
data=pd.read_csv("nba.csv")
print(data.tail())

             Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

In [9]:
series=data["Name"]
bottom=series.tail(n=7)
print(bottom)

451    Chris Johnson
452       Trey Lyles
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, dtype: object

In [10]:
salary_name=data[['Name','Salary']].tail()
salary_name

             Name     Salary
453  Shelvin Mack  2433333.0
454     Raul Neto   900000.0
455  Tibor Pleiss  2900000.0
456   Jeff Withey   947276.0
457           NaN        NaN

<code>describe()</code>
<p style="font-family:Cursive">Pandas generates descriptive statistics of DataFrame columns which provides key metrics like mean, standard deviation, percentiles and more. </p>

<code>DataFrame.describe(percentiles=None, include=None, exclude=None)</code>
<p style="font-family:Cursive">percentiles: A list of numbers between 0 and 1 specifying which percentiles to return. The default is None which returns the 25th, 50th and 75th percentiles.
include: A list of data types to include in the summary like int, float, object for strings. Default is None means all numeric types are included.
exclude: A list of data types to exclude from the summary. Default is None means no types are excluded.</p>

In [11]:
data.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

<li>count: Total number of non-null entries in each column.</li>
<li>mean: Average (mean) of the values in the column.</li>
<li>std: Standard deviation showing how spread out the values are</li>
<li>min: Minimum value in the column</li>
<li>25%: The 25th percentile (Q1) which means 25% of the data points are less than this value.</li>
<li>50%: Median value (50th percentile) where half the data points are below it.</li>
<li>75%: The 75th percentile (Q3) means 75% of the data points are below this value.</li>
<li>max: Maximum value in the column.</li>

In [12]:
desc=data.describe(percentiles=[.20,.40,.60,.80],include=['object','float','int'])
desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,457,457.000000,457,457.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,102,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.938731,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.404016,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.600000,NaN,9.472760e+05
40%,NaN,NaN,10.000000,NaN,25.000000,NaN,213.400000,NaN,1.938840e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
60%,NaN,NaN,18.600000,NaN,27.000000,NaN,230.000000,NaN,3.815000e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,245.000000,NaN,8.042895e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

<li>count: Total number of non-null values</li>
<li>unique: Number of unique values in the column.</li>
<li>top: Most frequent value in the column.</li>
<li>freq: Frequency of the most common value.</li>

In [13]:
desc=data["Name"].describe()
desc

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [14]:
salary_desc=data["Salary"].describe()
salary_desc

count    4.460000e+02
mean     4.842684e+06
std      5.229238e+06
min      3.088800e+04
25%      1.044792e+06
50%      2.839073e+06
75%      6.500000e+06
max      2.500000e+07
Name: Salary, dtype: float64

<h2 style="font-family:Cursive">Dealing with Rows and Columns in Pandas DataFrame</h1>
<h3 style="font-family:Cursive">dealing with columns</h3>
<li style="font-family:Cursive">Adding columns</li>
<li style="font-family:Cursive">deleting columns</li>
<h3 style="font-family:Cursive">dealing with rows</h3>
<li style="font-family:Cursive">selecting rows</li>
<li style="font-family:Cursive">Adding rows</li>
<li style="font-family:Cursive">Deleting rows</li>
<li style="font-family:Cursive"><code>pd.concat([new_row, df])</code>combines the new row with the existing DataFrame.</li>
<li style="font-family:Cursive"><code>.reset_index(drop=True)</code>resets the index to maintain sequential row numbering.
</li>

In [15]:
df=pd.read_csv('nba.csv')
df[['Name','Age']]

              Name   Age
0    Avery Bradley  25.0
1      Jae Crowder  25.0
2     John Holland  27.0
3      R.J. Hunter  22.0
4    Jonas Jerebko  29.0
..             ...   ...
453   Shelvin Mack  26.0
454      Raul Neto  24.0
455   Tibor Pleiss  26.0
456    Jeff Withey  26.0
457            NaN   NaN

[458 rows x 2 columns]

In [16]:
df['Experience']=10
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Experience
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,10
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,10
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,10
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,10
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,10

In [17]:
df.drop('Experience',axis=1,inplace=True)
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [18]:
data = pd.read_csv("nba.csv", index_col="Name")
first=data.loc["Avery Bradley"]
second=data.loc["R.J. Hunter"]
print(first,"\n\n",second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [20]:
df=pd.read_csv('nba.csv')
new_row = {
    'Name': 'Geeks',
    'Team': 'Boston',
    'Number': 3,
    'Position': 'PG',
    'Age': 33,
    'Height': '6-2',
    'Weight': 189,
    'College': 'MIT',
    'Salary': 99999
}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
df.tail(2)

      Name    Team  Number Position   Age Height  Weight College   Salary
457    NaN     NaN     NaN      NaN   NaN    NaN     NaN     NaN      NaN
458  Geeks  Boston     3.0       PG  33.0    6-2   189.0     MIT  99999.0

<code>df.rename(columns={...}, inplace=True)</code>
<p style="font-family:Cursive">renames specified columns in the dictionary.</p>

In [21]:
import pandas as pd
df = pd.DataFrame({'A': [10, 20], 'B': [30, 40], 'C': [50, 60]})
df.rename(columns={'A': 'X', 'B': 'Y'}, inplace=True)
print(df)

    X   Y   C
0  10  30  50
1  20  40  60

<p style="font-family:Cursive">The set_axis method can be used to rename all columns in a DataFrame. This function takes a list of new column names and an axis (0 for rows, 1 for columns) and returns a DataFrame with renamed columns.</p>

In [1]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4], 'C': [5, 6]})
df = df.set_axis(['Alpha', 'Beta', 'Gamma'], axis=1)
print(df)

   Alpha  Beta  Gamma
0      1     3      5
1      2     4      6

<p style="font-family:Cursive">add_prefix() or add_suffix() adds a prefix or suffix to all column names</p>

In [2]:
df=pd.DataFrame({'A':[1,2],'B':[3,4]})
pre=df.add_prefix('new')
suf=df.add_suffix('_val')
print("Prefixed:\n",pre)
print("Suffixed:\n",suf)

Prefixed:
    newA  newB
0     1     3
1     2     4
Suffixed:
    A_val  B_val
0      1      3
1      2      4

<p style="font-family:Cursive">Use df.columns.str.replace() to replace unwanted characters in column names. Handy for spaces, symbols or standardizing column names.</p>

In [3]:
df=pd.DataFrame({'First Name':['A','B'],'Last Name':['C','D']})
df.columns=df.columns.str.replace(' ','_')
print(df)

  First_Name Last_Name
0          A         C
1          B         D

In [5]:
import pandas as pd

data = pd.DataFrame({
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5']
})
print(data)
df = data.drop('B', axis=1)
print(df)

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A4  B4  C4
4  A5  B5  C5
    A   C
0  A1  C1
1  A2  C2
2  A3  C3
3  A4  C4
4  A5  C5

In [7]:
df = data.drop(['B', 'C'], axis=1)
df

    A
0  A1
1  A2
2  A3
3  A4
4  A5

In [9]:
df = data.drop(data.columns[[0, 2]], axis=1)
df

    B
0  B1
1  B2
2  B3
3  B4
4  B5

In [10]:
df = data.drop(columns=data.loc[:, 'B':'C'].columns)
df

    A
0  A1
1  A2
2  A3
3  A4
4  A5

In [11]:
p1 = data.pop('B')
print(p1)

0    B1
1    B2
2    B3
3    B4
4    B5
Name: B, dtype: object

In [12]:
import pandas as pd
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, None, None, 4],
    'C': [1, 2, 3, 4]
})
threshold = len(df) * 0.5
df = df.dropna(thresh=threshold, axis=1)
print(df)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3
3  4.0  4

In [14]:
import pandas as pd
data = {'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
        'B': ['B1', 'B2', 'B3', 'B4', 'B4'],
        'C': ['C1', 'C2', 'C3', 'C3', 'C3'],
        'D': ['D1', 'D2', 'D2', 'D2', 'D2'],
        'E': ['E1', 'E1', 'E1', 'E1', 'E1']}
        
df = pd.DataFrame(data)
print(df)
unique_B = df['B'].unique()
print(unique_B)

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E1
2  A3  B3  C3  D2  E1
3  A4  B4  C3  D2  E1
4  A5  B4  C3  D2  E1
['B1' 'B2' 'B3' 'B4']

<p style="font-family:Cursive">The nunique() method counts the number of unique values in a column. It is useful when you only need the count of distinct values rather than the values themselves.</p>

In [15]:
print("Unique count in A:", df['A'].nunique())
print("Unique count in B:", df['B'].nunique())
print("Unique count in C:", df['C'].nunique())
print("Unique count in D:", df['D'].nunique())

Unique count in A: 5
Unique count in B: 4
Unique count in C: 3
Unique count in D: 2

In [16]:
unique_C = df['C'].drop_duplicates()
print(unique_C)

0    C1
1    C2
2    C3
Name: C, dtype: object

In [17]:
counts_D = df['D'].value_counts()
unique_D = counts_D.index
print("Value counts in D:\n", counts_D)
print("Unique values in D:", list(unique_D))

Value counts in D:
 D
D2    4
D1    1
Name: count, dtype: int64
Unique values in D: ['D2', 'D1']

In [18]:
unique_set_D = set(df['D'])
print(unique_set_D)

{'D2', 'D1'}

<p style="font-family:Cursive">In Pandas, you can easily lowercase all values in a column using either the .str.lower() method or .apply() method with a lambda function.</p>

In [19]:
import pandas as pd

# creating a sample dataframe
df = pd.DataFrame({'A': ['John', 'bODAY', 'MinA', 'Peter', 'nicky'],
                  'B': ['masters', 'graduate', 'graduate',
                                   'Masters', 'Graduate'],
                  'C': [27, 23, 21, 23, 24]})
 
df

       A         B   C
0   John   masters  27
1  bODAY  graduate  23
2   MinA  graduate  21
3  Peter   Masters  23
4  nicky  Graduate  24

In [20]:
df['A'] = df['A'].str.lower()
df

       A         B   C
0   john   masters  27
1  boday  graduate  23
2   mina  graduate  21
3  peter   Masters  23
4  nicky  Graduate  24

In [21]:
df['A'].apply(lambda x: x.lower())
df

       A         B   C
0   john   masters  27
1  boday  graduate  23
2   mina  graduate  21
3  peter   Masters  23
4  nicky  Graduate  24

In [22]:
import pandas as pd 
df = pd.DataFrame({'A': ['john', 'harry', 'alice', 'peter', 'nicky'], 
				'B': ['masters', 'graduate', 'graduate','Masters', 'Graduate'], 
				'C': [27, 23, 21, 23, 24]}) 
print(df)

       A         B   C
0   john   masters  27
1  harry  graduate  23
2  alice  graduate  21
3  peter   Masters  23
4  nicky  Graduate  24

In [25]:
df['A'] = df['A'].str.title()
print(df)

       A         B   C
0   John   masters  27
1  Harry  graduate  23
2  Alice  graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

In [26]:
df['A'] = df['A'].str.capitalize() 
print(df)

       A         B   C
0   John   masters  27
1  Harry  graduate  23
2  Alice  graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

In [27]:
df['A'] = df['A'].apply(lambda x: x.capitalize())
print(df)

       A         B   C
0   John   masters  27
1  Harry  graduate  23
2  Alice  graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

In [28]:
df['A'] = df['A'].str.replace(r'(^[a-z])', lambda x: x.group(1).upper(), regex=True)
print(df)

       A         B   C
0   John   masters  27
1  Harry  graduate  23
2  Alice  graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

<code>nlargest(n, columns, keep='first')</code>
<p style="font-family:Cursive">n: number of top rows you want to return
columns: column (or list of columns) you want to check for the largest values.
keep: Decides what to do if there are duplicate values:
'first': keeps the first occurrence (default).
'last': keeps the last occurrence.
'all': keeps all duplicates.</p>

In [29]:
df=pd.read_csv("nba.csv")
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [30]:
df.nlargest(5,['Age'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
298,Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
304,Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
400,Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
102,Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
261,Vince Carter,Memphis Grizzlies,15.0,SG,39.0,6-6,220.0,North Carolina,4088019.0

In [31]:
df.nlargest(10, ['Weight'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
405,Nikola Pekovic,Minnesota Timberwolves,14.0,C,30.0,6-11,307.0,NaN,12100000.0
302,Boban Marjanovic,San Antonio Spurs,40.0,C,27.0,7-3,290.0,NaN,1200000.0
330,Al Jefferson,Charlotte Hornets,25.0,C,31.0,6-10,289.0,NaN,13500000.0
395,Jusuf Nurkic,Denver Nuggets,23.0,C,21.0,7-0,280.0,NaN,1842000.0
188,Andre Drummond,Detroit Pistons,0.0,C,22.0,6-11,279.0,Connecticut,3272091.0
41,Kevin Seraphin,New York Knicks,1.0,C,26.0,6-10,278.0,NaN,2814000.0
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000.0
56,Jahlil Okafor,Philadelphia 76ers,8.0,C,20.0,6-11,275.0,Duke,4582680.0
155,Cristiano Felicio,Chicago Bulls,6.0,PF,23.0,6-10,275.0,NaN,525093.0
176,Timofey Mozgov,Cleveland Cavaliers,20.0,C,29.0,7-1,275.0,NaN,4950000.0

In [32]:
import pandas as pd

df = pd.DataFrame({"Person": ["Zoe", "Max", "Liam", "Nora", "Owen"],
                   "Dept":   ["Sales", "IT", "HR", "Finance", "IT"],
                   "Score":  [88, 92, 75, 85, 90]})
print(df)

  Person     Dept  Score
0    Zoe    Sales     88
1    Max       IT     92
2   Liam       HR     75
3   Nora  Finance     85
4   Owen       IT     90

In [33]:
d = df.copy()
r = d.set_index("Person")
print(r)

           Dept  Score
Person
Zoe       Sales     88
Max          IT     92
Liam         HR     75
Nora    Finance     85
Owen         IT     90

In [34]:
d = df.copy()
d.index = d.pop("Person")
print(d)

           Dept  Score
Person
Zoe       Sales     88
Max          IT     92
Liam         HR     75
Nora    Finance     85
Owen         IT     90

In [35]:
d = df.copy()
d.index = d["Person"]
print("After assigning index (column still present):\n", d)

d2 = d.drop(columns="Person")
print("After dropping the original column:\n", d2)

After assigning index (column still present):
        Person     Dept  Score
Person
Zoe       Zoe    Sales     88
Max       Max       IT     92
Liam     Liam       HR     75
Nora     Nora  Finance     85
Owen     Owen       IT     90
After dropping the original column:
            Dept  Score
Person
Zoe       Sales     88
Max          IT     92
Liam         HR     75
Nora    Finance     85
Owen         IT     90

<h2 style="font-family:Cursive">Pandas Extracting rows using .loc[]</h2>
<p style="font-family:Cursive">a method that takes only index labels and returns row or dataframe if the index label exists in the caller data frame.</p>
<code>pandas.DataFrame.loc[]</code>

In [1]:
import pandas as pd
data=pd.read_csv("nba.csv",index_col="Name")
first=data.loc["Avery Bradley"]
second=data.loc["R.J. Hunter"]
print(first,"\n\n\n",second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [3]:
data=pd.read_csv("nba.csv",index_col="Team")
rows=data.loc["Utah Jazz"]
print((rows))

                     Name  Number Position   Age Height  Weight       College  \
Team
Utah Jazz   Trevor Booker    33.0       PF  28.0    6-8   228.0       Clemson
Utah Jazz      Trey Burke     3.0       PG  23.0    6-1   191.0      Michigan
Utah Jazz      Alec Burks    10.0       SG  24.0    6-6   214.0      Colorado
Utah Jazz      Dante Exum    11.0       PG  20.0    6-6   190.0           NaN
Utah Jazz  Derrick Favors    15.0       PF  24.0   6-10   265.0  Georgia Tech
Utah Jazz     Rudy Gobert    27.0        C  23.0    7-1   245.0           NaN
Utah Jazz  Gordon Hayward    20.0       SF  26.0    6-8   226.0        Butler
Utah Jazz     Rodney Hood     5.0       SG  23.0    6-8   206.0          Duke
Utah Jazz      Joe Ingles     2.0       SF  28.0    6-8   226.0           NaN
Utah Jazz   Chris Johnson    23.0       SF  26.0    6-6   206.0        Dayton
Utah Jazz      Trey Lyles    41.0       PF  20.0   6-10   234.0      Kentucky
Utah Jazz    Shelvin Mack     8.0       PG  26.0    6-3   203.0        Butler
Utah Jazz       Raul Neto    25.0       PG  24.0    6-1   179.0           NaN
Utah Jazz    Tibor Pleiss    21.0        C  26.0    7-3   256.0           NaN
Utah Jazz     Jeff Withey    24.0        C  26.0    7-0   231.0        Kansas

               Salary
Team
Utah Jazz   4775000.0
Utah Jazz   2658240.0
Utah Jazz   9463484.0
Utah Jazz   3777720.0
Utah Jazz  12000000.0
Utah Jazz   1175880.0
Utah Jazz  15409570.0
Utah Jazz   1348440.0
Utah Jazz   2050000.0
Utah Jazz    981348.0
Utah Jazz   2239800.0
Utah Jazz   2433333.0
Utah Jazz    900000.0
Utah Jazz   2900000.0
Utah Jazz    947276.0

In [4]:
# Extracting rows between two index labels
import pandas as pd 

# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 

# retrieving rows by loc method 
rows = data.loc["Avery Bradley":"Isaiah Thomas"] 

print(type(rows)) 

rows

<class 'pandas.core.frame.DataFrame'>

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0

<h3 style="font-family:Cursive">Pandas .iloc[] Syntax</h3>
<p>
<code>
Syntax: pandas.DataFrame.iloc[] 

Parameters:  Index position of rows in integer or list of integer. 

Return type: Data frame or Series depending on parameters
</code></p>

In [5]:
data=pd.read_csv("nba.csv")
row1=data.iloc[[4,5,6,7]]
row2=data.iloc[4:8]
row1==row2

   Name  Team  Number  Position   Age  Height  Weight  College  Salary
4  True  True    True      True  True    True    True    False    True
5  True  True    True      True  True    True    True    False    True
6  True  True    True      True  True    True    True     True    True
7  True  True    True      True  True    True    True     True    True

In [10]:
data=pd.DataFrame({
    'Name':['Geek1','Geek2','Geek3','Geek4','Geek5'],
    'Age':[25,30,22,35,28],
    'Salary':[50000,60000,45000,70000,55000]
})
data.set_index('Name',inplace=True)
print("Orginal Dataframe")
print(data)
row=data.iloc[0,:]
print("\nExtracted Row (Geek1):")
print(row)
row2=data.iloc[1:3,:]
print("\nExtracted rows (Geek2 to Geek3):")
print(row2)

Orginal Dataframe
       Age  Salary
Name
Geek1   25   50000
Geek2   30   60000
Geek3   22   45000
Geek4   35   70000
Geek5   28   55000

Extracted Row (Geek1):
Age          25
Salary    50000
Name: Geek1, dtype: int64

Extracted rows (Geek2 to Geek3):
       Age  Salary
Name
Geek2   30   60000
Geek3   22   45000

In [14]:
#selecting specific Rows and columns
data = pd.read_csv("nba.csv", index_col="Name")
selection = data.loc[["Avery Bradley", "R.J. Hunter"], ["Team", "Number", "Position"]]
print(selection)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
R.J. Hunter    Boston Celtics    28.0       SG

In [15]:
value = data.at["Avery Bradley", "Age"]
print(value)

25.0

In [16]:
result = data.query("Age > 25 and College == 'Duke'")
print(result)

                                    Team  Number Position   Age Height  \
Name
Lance Thomas             New York Knicks    42.0       SF  28.0    6-8
Elton Brand           Philadelphia 76ers    42.0       PF  37.0    6-9
JJ Redick           Los Angeles Clippers     4.0       SG  31.0    6-4
Mike Dunleavy              Chicago Bulls    34.0       SG  35.0    6-9
Dahntay Jones        Cleveland Cavaliers    30.0       SG  35.0    6-6
Miles Plumlee            Milwaukee Bucks    18.0        C  27.0   6-11
Luol Deng                     Miami Heat     9.0       SF  31.0    6-9
Josh McRoberts                Miami Heat     4.0       PF  29.0   6-10
Kyle Singler       Oklahoma City Thunder     5.0       SF  28.0    6-8
Gerald Henderson  Portland Trail Blazers     9.0       SG  28.0    6-5
Mason Plumlee     Portland Trail Blazers    24.0        C  26.0   6-11

                  Weight College      Salary
Name
Lance Thomas       235.0    Duke   1636842.0
Elton Brand        254.0    Duke         NaN
JJ Redick          190.0    Duke   7085000.0
Mike Dunleavy      230.0    Duke   4500000.0
Dahntay Jones      225.0    Duke         NaN
Miles Plumlee      249.0    Duke   2109294.0
Luol Deng          220.0    Duke  10151612.0
Josh McRoberts     240.0    Duke   5543725.0
Kyle Singler       228.0    Duke   4500000.0
Gerald Henderson   215.0    Duke   6000000.0
Mason Plumlee      235.0    Duke   1415520.0

<table style="border-collapse: collapse; width: 100%; color: white; font-family: cursive;">
  <thead>
    <tr>
      <th style="border: 1px solid white; padding: 10px; text-align: left;">
        Function
      </th>
      <th style="border: 1px solid white; padding: 10px; text-align: left;">
        Description
      </th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.iat[]
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Access a single value for a row/column pair by integer position.
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.pop()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Return item and drop from DataFrame.
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.xs()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Return a cross-section (row(s) or column(s)) from the DataFrame.
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.get()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Get item from object for given key (e.g. DataFrame column).
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.isin()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Return a boolean DataFrame showing whether each element is contained in values.
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.where()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Return object of same shape where condition is True, otherwise replace.
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.mask()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Return object of same shape where condition is False, otherwise replace.
      </td>
    </tr>
    <tr>
      <td style="border: 1px solid white; padding: 8px;">
        DataFrame.insert()
      </td>
      <td style="border: 1px solid white; padding: 8px;">
        Insert a column into DataFrame at a specified location.
      </td>
    </tr>
  </tbody>
</table>

In [ ]:
dict={'name':['aparna','pankaj','sudhir','geeku'],
    'degree':['MBA','BCA','M.Tech','MBA'],
    'score':[90,40,80,98]}
df=pd.DataFrame(dict,index=[True,False,True,False])
print(df)
print(df.loc[True])
print(df.iloc[1])
# print(df.ix[1])

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.Tech     80
False   geeku     MBA     98
        name  degree  score
True  aparna     MBA     90
True  sudhir  M.Tech     80
name      pankaj
degree       BCA
score         40
Name: False, dtype: object

AttributeError: 'DataFrame' object has no attribute 'ix'

<p style="font-family:Cursive">In order to access a dataframe using .ix[], we have to pass boolean value (True or False) and integer value to .ix[] function because as we know that .ix[] function is a hybrid of .loc[] and .iloc[] function</p>

In [22]:
# importing pandas as pd
import pandas as pd
 
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

# creating a dataframe with boolean index 
df = pd.DataFrame(dict, index = [True, False, True, False])
 

# accessing a dataframe using .ix[] function
print(df.ix[1])

AttributeError: 'DataFrame' object has no attribute 'ix'

In [23]:
# importing pandas module 
import pandas as pd 
  
# making data frame 
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv") 
  
# removing null values to avoid errors 
data.dropna(inplace = True) 

# start stop and step variables
start, stop, step = 0, -2, 1

# converting to string data type
data["Salary"]= data["Salary"].astype(str)

# slicing till 2nd last element
data["Salary (int)"]= data["Salary"].str.slice(start, stop, step)

# display
data.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Salary (int)
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,6796117
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,1148640
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,1170960
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,2165160
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0,1824360
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0,3431040
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0,2569260
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0,6912869
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0,3425510